Дипломный_проект/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ПЕРИОД</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоровРеализаций</name>
    <attributes>
      <name>СписокДоговор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СписокРеализаций</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Дипломный_проект/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/ВКМ_ФормаСозданияАктов/Module.bsl
&НаКлиенте
Процедура СоздатьСписок(Команда)
	
	ДлительнаяОперация = ВыполнитьФоновоеЗаданиеНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьДанныеТабличнойЧасти", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ВКМ_СозданиеАктовВФоне.СозданиеДоговоровИРеализаций", 
	Объект.ПЕРИОД.ДатаНачала, Объект.ПЕРИОД.ДатаОкончания);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДанныеТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Сообщить("А =1");
	КонецЕсли;
	
	СписокЗапроса = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Объект.СписокДоговоровРеализаций.Очистить(); 
	
	Для Каждого Строка Из СписокЗапроса Цикл 
		
		НоваяСтрока = Объект.СписокДоговоровРеализаций.Добавить();
		НоваяСтрока.СписокДоговор = Строка.Договор;       
		НоваяСтрока.СписокРеализаций = Строка.Реализация;
		
	КонецЦикла;
КонецПроцедуры
